<template>
  <v-app>
    <v-container>
      <ToolsBackButton />
      <h1 id="title">星陵祭とは</h1>
      <p>
        日比谷高校の文化祭は「星陵祭」と呼ばれており、全クラスが劇を行います。
        今年の星陵祭のテーマは「Magic」です。
        日比谷生が劇やパフォーマンス、校内に施された装飾物
        によって、あなたを魔法にかけます。最高の夏を星陵祭で。来場お待ちしています！
      </p>
      <h2>星陵祭って何をやってる？</h2>
      <h3>クラス劇</h3>
      <p>
        星陵祭では、全てのクラスがそれぞれの教室(特別教室を使用するクラスもあります)で生徒がキャストとなって劇を行います。ミュージカルなどの有名な劇から、自作劇まで様々なジャンルの劇があります。キャストだけでなく、音響や照明などの仕事も生徒がやっています。夏休み前から装飾の制作やキャストの練習に励んできた、日比谷生の本気の劇をぜひお楽しみください！
      </p>
      <h3>企画</h3>
      <p>
        【迷路】<br />
        ゴラちゃんタイムアタック
        タイムアタック要素を加えた迷路が11Rで楽しめます！マンドラゴラの妖精ゴラちゃんの悲鳴が響く植物園を抜けて、一刻も早く彼（彼女？）を鉢に戻してあげよう！<br />
        ⚠11Rは社会科教室での公演となります<br />
        @11R
      </p>
      <p>
        【休憩所】<br />
        ゆっくり休める場所ができました！折り紙やお絵描きなど楽しめるスペースもあるのでぜひお越しください！<br />
        ⚠12Rは書道教室での公演となります<br />
        @12R
      </p>
      <p>
        【バルーンアート】<br />
        射的で的を倒すと魔法らしいバルーンアートをゲット！一緒にバルーンアートを作るワークショップも開催、一緒に楽しもう！！<br />
        @生徒ホール
      </p>
      <p>
        【謎解き】<br />
        あなたは日比谷高校を訪れた見習い魔法使い。それぞれが選んだ謎解きの試練を乗り越え、魔法を習得して行きましょう！優秀な魔法使いには素敵な景品も待っています！<br />
        @生徒ホール
      </p>
      <p>
        【クラスTシャツ】<br />
        今年も社会科ホールにやってまいりました、クラスTシャツコンテスト！
        個性あふれるクラスTシャツが溢れています！ぜひ足をお運びください！<br />
        @社会科ホール
      </p>
      <p>
        【Talent Showcase】<br />
        ダンス部や軽音部などの部活からのど自慢コンテストといった企画ものまで勢揃い！！個性溢れるステージに、あなたは魔法にかけられたように魅了されることでしょう！<br />
        @アリーナ
      </p>
      <p>
        【スタンプラリー】<br />
        学校巡りをしてスタンプを集めよう！
        パンフレットのスタンプラリーページを開けて、レッツ探検！<br />
        @学校中
      </p>
      <h3>装飾物</h3>
      <p>
        【アーチ】<br />
        約1000人の集大成である星陵祭！その幕開けはもちろんアーチから！不思議な世界への第一歩を踏み出そう！<br />
        @通用門
      </p>
      <p>
        【カウントダウンパネル】<br />
        まだかまだかと生徒たちが毎日見つめてきた魔法のような模様のカウントダウンパネル、是非ご覧ください。<br />
        @星陵像前
      </p>
      <p>
        【階段装飾】<br />
        魔法陣の中に展開される、二つの対照的な世界！一歩一歩で、あなたを星陵祭の魔法へといざないます。<br />
        @大階段
      </p>
      <p>
        【大垂れ幕】<br />
        アーケードを抜けると見える大迫力な垂れ幕に、テンション上がること間違いなし！魔法少女の必殺技でみんなの心を射抜きます♡<br />
        @校舎外壁
      </p>
      <p>
        【校内装飾】<br />
        開かれた深緑のドアの向こうに広がる魔法の世界、割れたレンガのはざまから射す光を立体的に表現し、また日比谷高校の1年間の写真をイルミネーションとともに飾ります。<br />
        @1.2.4階廊下
      </p>
      <p>
        【校内案内】<br />
        洗練された無駄のない案内で、皆様の快適さをサポートします。日比谷生の作り上げる星陵祭を存分にお楽しみください！<br />
      </p>
      <p>
        【窓装飾】<br />
        チーフ会員の心血が注がれた窓装飾が今年も登場！光に輝くデザインが校内を彩ります。部門を超えた努力の結晶を、ぜひその目でお確かめください！<br />
        @体育館棟窓・各教室や廊下の窓
      </p>
      <p>
        【インスタ映えスポット】<br />
        海をモチーフにした、まだまだ暑い今にぴったりなインスタ映えスポットです！たくさん写真を撮って星陵祭の思い出の1つにしてください！！<br />
        @生徒ホール
      </p>
      <p>
        【寄せ書き】<br />
        日比谷高校来場記念の記録として、感想や合格祈願を記しに、是非お立ち寄りください！<br />
        @生徒ホール前
      </p>
    </v-container>
  </v-app>
</template>

<script lang="ts">
import Vue from 'vue'
export default Vue.extend({
  name: 'AboutPage',
  auth: false,
  head: {
    title: '星陵祭とは',
  },
})
</script>

<style scoped>
h2 {
  text-align: center;
  font-weight: normal;
}

#title {
  display: inline-block;
  padding: 0.5rem 3rem 0.5rem 0;
  margin-bottom: 5rem;
  border-bottom: 3px solid var(--theme-color);
  font-family: serif;
  font-weight: bold;
}
</style>
