<template>
  <v-app>
    <v-container>
      <ToolsBackButton />
      <v-row justify="center">
        <v-col cols="11">
          <h1 id="title">整理券制度</h1>
          <h3>＜整理券制度概要＞</h3>
          <ul>
            <li>
              今年度はどなたでも事前予約や整理券なしで星陵祭に入場することができます。
            </li>
            <li>
              星陵祭では全クラスが演劇を行います。<span
                style="font-weight: bold"
                >観劇については整理券が必須になります</span
              >。
            </li>
            <li>
              全クラスが同じ時刻に公演を行っています。また整理券配布時刻も公演ごとに決められています。公演時刻や整理券配布時刻は<NuxtLink
                to="/schedule"
                >スケジュール</NuxtLink
              >をご覧下さい。また整理券は売り切れ次第、配布終了になります。
            </li>
            <li>
              今年度は<span style="font-weight: bold"
                >当ホームページを用いてオンラインで整理券を取得することが出来ます</span
              >。
            </li>
            <li>
              当ホームページを用いてオンラインで整理券を取得することが出来ます
            </li>
            <li>
              一つのアカウントで一回の公演につき３枚整理券が取得できます。受付にて団体の人数に応じて、アカウントを配布します。
            </li>
          </ul>
          <br />
          <h3>＜お困りごとがあった場合＞</h3>
          <ul>
            <li>
              アカウント・パスワードを忘れた場合は体育棟一階・整理券相談所（<NuxtLink
                to="/map"
                >校内マップ</NuxtLink
              >）までお越しください。アカウントを再配布致します。
            </li>
            <li>
              その他トラブルが発生した場合、体育棟一階・整理券相談所（<NuxtLink
                to="/map"
                >校内マップ</NuxtLink
              >）までお越しください。
            </li>
          </ul>
          <br />
          <h3>＜保護者の方々＞</h3>
          <ul>
            <li>
              保護者の皆様は事前に配布されたアカウントで当ホームぺージにログインし、お子様のクラス劇の優先整理券を最大２席分（２公演）まで取ることができます。
            </li>
            <li>
              公演時間前になったらクラスへ行き、当ホームページの画面下「整理券」タブを開いて画面をクラス受付に見せてください。
            </li>
            <li>
              優先券使用後も一般の皆様と同じように整理券を取得できます。＜一般整理券取得方法＞を参考にしてください。
            </li>
          </ul>
          <br />
          <h3>＜一般整理券取得方法＞</h3>
          <ol>
            <li>
              ログインを行う<br />
              当ホームページの画面左上の三本線をタップして、表示された「ログイン」ボタンを押してください。保護者の場合は既にログインしているはずです。保護者や本校生徒でない場合は受付でもらったアカウントとパスワードを入力し、ログインしてください。
            </li>
            <li>
              クラス劇を選択する<br />
              画面下の「探す」タブもしくは「配布状況」タブを選択し、見たいクラス劇を選択して下さい。<br />
              「探す」タブからは詳しい劇の説明、「配布状況」タブでは一目で整理券が売り切れているかどうか確認できます。
            </li>
            <li>
              見たい公演を指定する<br />
              そのまま下にスクロールし、「配布中」になっている公演を選択してください。
              整理券は公演ごとに配布時間が決まっています。詳しい時間帯は「<NuxtLink
                to="/schedule"
                >スケジュール</NuxtLink
              >」をご覧ください。また整理券は無くなり次第、配布終了致します。
            </li>
            <li>
              取得済み整理券を確認する<br />
              画面下の「整理券」タブから、整理券が取得できているか確認できます。
              公演前になったらクラスへ行き、「整理券」タブの画面をクラス受付に見せてください。
            </li>
          </ol>
          <br />
          <h3>＜投票方法＞</h3>
          <ul>
            <li>
              観劇が終わったら、投票にご協力お願いします。観劇したクラスの中から一つのアカウントにつき２クラス投票することが可能です。画面下の「整理券」タブから投票したいクラスを選んでください。
            </li>
            <li>
              なお、特別審査員による審査で順位を決定するため、３年生は投票を行っていません。１・２年生のクラスの中から投票して下さい。
            </li>
            <li>
              投票結果・順位は9/15（日）、18時ごろに当ホームページにて掲載予定です。
            </li>
          </ul>
        </v-col>
      </v-row>
    </v-container>
  </v-app>
</template>

<script lang="ts">
import Vue from 'vue'
export default Vue.extend({
  name: 'AboutPage',
  auth: false,
  head: {
    title: '整理券制度',
  },
})
</script>

<style scoped>
h3 {
  text-align: left;
  font-weight: normal;
}

#title {
  display: inline-block;
  padding: 0.5rem 3rem 0.5rem 0;
  margin-bottom: 5rem;
  border-bottom: 3px solid var(--theme-color);
  font-family: serif;
  font-weight: bold;
}
</style>
